hurrican/hurrican-acceptance-test/src/citrus/resources/templates/ffm/v1/FFM_CreateOrder_12/createOrder.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <wfs:createOrder xmlns:wfs="http://www.mnet.de/esb/cdm/Resource/WorkforceService/v1">
            <wfs:order>
                <wfs:id>@startsWith('HUR_')@</wfs:id>
                <wfs:displayId>@startsWith('${order.no}-')@</wfs:displayId>
                <wfs:customerOrderId>${order.no}</wfs:customerOrderId>
                <wfs:description>
                    <wfs:summary>FTTX Telefon</wfs:summary>
                    <wfs:techParams>
                        <wfs:common>
                            <wfs:lineId>@ignore@</wfs:lineId>
                            <wfs:contractId>@ignore@</wfs:contractId>
                            <wfs:customerNumber>@ignore@</wfs:customerNumber>
                            <wfs:additionalContractInfo>${order.no}</wfs:additionalContractInfo>
                            <wfs:porting>
                                <wfs:portingDate>@matchesDatePattern('dd.MM.yyyy')@</wfs:portingDate>
                                <wfs:lastCarrier>@ignore@</wfs:lastCarrier>
                            </wfs:porting>
                        </wfs:common>
                        <wfs:CPE>
                            <wfs:type>@ignore@</wfs:type>
                            <wfs:manufacturer>@ignore@</wfs:manufacturer>
                            <wfs:model>@ignore@</wfs:model>
                            <wfs:serialNumber>@ignore@</wfs:serialNumber>
                        </wfs:CPE>
                        <wfs:CPE>
                            <wfs:type>@ignore@</wfs:type>
                            <wfs:serialNumber>@ignore@</wfs:serialNumber>
                            <wfs:NAT>@ignore@</wfs:NAT>
                            <wfs:DNS>@ignore@</wfs:DNS>
                            <wfs:SNMPMnet>@ignore@</wfs:SNMPMnet>
                            <wfs:SNMPCustomer>@ignore@</wfs:SNMPCustomer>
                            <wfs:QoS>@ignore@</wfs:QoS>
                        </wfs:CPE>
                        <wfs:PSE>
                            <wfs:manufacturer>Huawei</wfs:manufacturer>
                            <wfs:model>PSE-235</wfs:model>
                            <wfs:version>1.0</wfs:version>
                        </wfs:PSE>
                        <wfs:IPSecS2S>
                            <wfs:hostName>@ignore@</wfs:hostName>
                            <wfs:hostNamePassive>@ignore@</wfs:hostNamePassive>
                            <wfs:WANIp>@ignore@</wfs:WANIp>
                            <wfs:WANSubnet>@ignore@</wfs:WANSubnet>
                            <wfs:WANGateway>@ignore@</wfs:WANGateway>
                            <wfs:loopbackIp>@ignore@</wfs:loopbackIp>
                            <wfs:loopbackIpPassive>@ignore@</wfs:loopbackIpPassive>
                            <wfs:VLANIp>@ignore@</wfs:VLANIp>
                            <wfs:encryptedNetwork>@ignore@</wfs:encryptedNetwork>
                            <wfs:VLANSubnet>@ignore@</wfs:VLANSubnet>
                            <wfs:dialInNumber>@ignore@</wfs:dialInNumber>
                            <wfs:splitTunnel>nein</wfs:splitTunnel>
                            <wfs:presharedKey>nein</wfs:presharedKey>
                            <wfs:certificate>nein</wfs:certificate>
                            <wfs:ipsDescription>@ignore@</wfs:ipsDescription>
                            <wfs:carrier>@ignore@</wfs:carrier>
                            <wfs:bandwidth>@ignore@</wfs:bandwidth>
                            <wfs:ipsType>@ignore@</wfs:ipsType>
                        </wfs:IPSecS2S>
                        <wfs:IPAddress>
                            <wfs:version>@ignore@</wfs:version>
                            <wfs:type>@ignore@</wfs:type>
                            <wfs:address>@ignore@</wfs:address>
                        </wfs:IPAddress>
                        <wfs:dialUpAccess>
                            <wfs:accountId>@ignore@</wfs:accountId>
                            <wfs:realm>@ignore@</wfs:realm>
                            <wfs:password>@ignore@</wfs:password>
                        </wfs:dialUpAccess>
                        <wfs:dialUpAccessVoIP>
                            <wfs:account>@ignore@</wfs:account>
                            <wfs:password>@ignore@</wfs:password>
                        </wfs:dialUpAccessVoIP>
                        <wfs:dialNumber>
                            <wfs:areaDialingCode>@ignore@</wfs:areaDialingCode>
                            <wfs:number>@ignore@</wfs:number>
                            <wfs:main>@ignore@</wfs:main>
                            <wfs:portMode>@ignore@</wfs:portMode>
                            <wfs:validFrom>@ignore@</wfs:validFrom>
                            <wfs:validTo>@ignore@</wfs:validTo>
                        </wfs:dialNumber>
                        <wfs:technicalService>
                            <wfs:tsType>@endsWith('STREAM')@</wfs:tsType>
                            <wfs:tsName>@endsWith(' kbit/s')@</wfs:tsName>
                        </wfs:technicalService>
                        <wfs:technicalService>
                            <wfs:tsType>@endsWith('STREAM')@</wfs:tsType>
                            <wfs:tsName>@endsWith(' kbit/s')@</wfs:tsName>
                        </wfs:technicalService>
                        <wfs:site>
                            <wfs:type>Endstelle_B</wfs:type>
                            <wfs:location>
                                <wfs:street>@ignore@</wfs:street>
                                <wfs:houseNumber>@ignore@</wfs:houseNumber>
                                <wfs:city>@ignore@</wfs:city>
                                <wfs:zipCode>@ignore@</wfs:zipCode>
                            </wfs:location>
                            <wfs:device>
                                <wfs:manufacturer>@ignore@</wfs:manufacturer>
                                <wfs:serialNumber>@ignore@</wfs:serialNumber>
                            </wfs:device>
                            <wfs:HVT>@ignore@</wfs:HVT>
                            <wfs:downstream>@ignore@</wfs:downstream>
                            <wfs:upstream>@ignore@</wfs:upstream>
                            <wfs:wiringData>
                                <wfs:type>@ignore@</wfs:type>
                                <wfs:deviceName>@ignore@</wfs:deviceName>
                                <wfs:moduleType>@ignore@</wfs:moduleType>
                                <wfs:physicType>FTTB_VDSL2</wfs:physicType>
                                <wfs:HWEQN>@ignore@</wfs:HWEQN>
                                <wfs:panelPin1>@ignore@</wfs:panelPin1>
                            </wfs:wiringData>
                        </wfs:site>
                    </wfs:techParams>
                </wfs:description>
                <wfs:type>Surf+Fon-Flat</wfs:type>
                <wfs:activityType>RTL_Neu_MK_FttB</wfs:activityType>
                <wfs:activitySubtype>Neuschaltung</wfs:activitySubtype>
                <wfs:contactPerson>
                    <wfs:role>@ignore@</wfs:role>
                    <wfs:firstName>@ignore@</wfs:firstName>
                    <wfs:lastName>@ignore@</wfs:lastName>
                    <wfs:communication>
                        <wfs:phone>@ignore@</wfs:phone>
                        <wfs:mobile>@ignore@</wfs:mobile>
                        <wfs:email>@ignore@</wfs:email>
                        <wfs:fax>@ignore@</wfs:fax>
                    </wfs:communication>
                </wfs:contactPerson>
                <wfs:contactPerson>
                    <wfs:role>@ignore@</wfs:role>
                    <wfs:firstName>@ignore@</wfs:firstName>
                    <wfs:lastName>@ignore@</wfs:lastName>
                    <wfs:communication>
                        <wfs:phone>@ignore@</wfs:phone>
                        <wfs:mobile>@ignore@</wfs:mobile>
                        <wfs:email>@ignore@</wfs:email>
                        <wfs:fax>@ignore@</wfs:fax>
                    </wfs:communication>
                </wfs:contactPerson>
                <wfs:qualification>Endkundenservice FTTB</wfs:qualification>
                <wfs:location>
                    <wfs:street>@ignore@</wfs:street>
                    <wfs:houseNumber>@ignore@</wfs:houseNumber>
                    <wfs:zipCode>@ignore@</wfs:zipCode>
                    <wfs:city>@ignore@</wfs:city>
                    <wfs:country>@ignore@</wfs:country>
                </wfs:location>
                <wfs:requestedTimeSlot>
                    <wfs:earliestStart>@ignore@</wfs:earliestStart>
                    <wfs:latestStart>@ignore@</wfs:latestStart>
                    <wfs:latestEnd>@ignore@</wfs:latestEnd>
                </wfs:requestedTimeSlot>
                <wfs:plannedDuration>@ignore@</wfs:plannedDuration>
            </wfs:order>
        </wfs:createOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>